:PROPERTIES:
:ID:       3D591887-9B7F-4D41-A7D0-5230F06A4D51
:END:
#+title: plantuml

PlantUML is a UML oriented diagram as code tool.

Mermaid is probably more popular nowadays, and more flexible, but
PlantUML supports some cases better, has more built-in support in
[[id:04B03591-50E7-41E2-A2A5-0C2893FAD39C][org-babel]], and avoids the [[id:F974B544-7B68-42E0-8978-DF4D1DECACA1][browser-sledgehammer]].

* Installation

plantuml is primarily distributed as a JAR, but also includes a
directly executable wrapper.

#+begin_src shell :results output
  plantuml --version
#+end_src

#+RESULTS:
#+begin_example
PlantUML version 1.2026.6 / 6287b33 [2026-06-08 16:02:56 UTC]
(GPL source distribution)

Build Version: 1.2026.6
Git Commit: 6287b33
Compile Time: 2026-06-08 16:02:56 UTC

Java Runtime: OpenJDK Runtime Environment
JVM: OpenJDK 64-Bit Server VM
Default Encoding: UTF-8
Language: en
Country: US
 
PLANTUML_LIMIT_SIZE: 4096

GraphViz: dot - graphviz version 15.0.0 (20260523.1842)
Installation seems OK. File generation OK
#+end_example

** [[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]]

*** [[id:61678BF7-A363-45C2-A3E2-54A1EB15EF68][brew]]

#+begin_src shell :async :session brew
  brew install plantuml --yes
#+end_src

#+RESULTS:
: 95f67eea-d4db-434b-9c59-6a62a7910798

* Help

#+begin_src shell :results output
  plantuml --help
#+end_src

#+RESULTS:
#+begin_example
plantuml - generate diagrams from plain text

Usage:
  java -jar plantuml.jar [options] [file|dir]...
  java -jar plantuml.jar [options] --gui

Description:
  Process PlantUML sources from files, directories (optionally recursive), or stdin (-pipe).

Wildcards (for files/dirs):
  ,*   any characters except '/' and '\'
  ?   exactly one character except '/' and '\'
  ,**  any characters across directories (recursive)
  Tip: quote patterns to avoid shell expansion (e.g., "**/*.puml").

General:

General:
     --author .................... Show information about PlantUML authors
     --check-graphviz ............ Check Graphviz installation
     --dark-mode ................. Render diagrams in dark mode
 -d, --define <VAR>=<value> ...... Define a preprocessing variable (equivalent to '!define <var> <value>')
     --duration .................. Print total processing time
     --gui ....................... Launch the graphical user interface
 -h, --help ...................... Show help and usage information
     --help-more ................. Show extended help (advanced options)
     --http-server[:<port>] ...... Start internal HTTP server for rendering (default port : 8080)
 -p, --pipe ...................... Read source from stdin, write result to stdout
     --progress-bar .............. Show a textual progress bar
     --splash-screen ............. Show splash screen with progress bar
 -v, --verbose ................... Enable verbose logging
     --version ................... Show PlantUML and Java version

Execution control:
     --check-before-run .......... Pre-check syntax of all inputs and stop faster on error
     --check-syntax .............. Check diagram syntax without generating images
     --no-error-image ............ Do not generate error images for diagrams with syntax errors
     --stop-on-error ............. Stop at the first syntax error

Metadata & assets:
     --extract-source ............ Extract embedded PlantUML source from PNG or SVG metadata
     --skip-fresh ................ Skip PNG/SVG files that are already up-to-date (using metadata)
     --sprite <4|8|16[z]> <file>   Encode a sprite definition from an image file

Output format (choose one):
 -f, --format <name> ............. Set the output format for generated diagrams
                                   (e.g. png, svg, pdf, eps, latex, txt, utxt, obfuscate, preproc...)

Available formats:
     --eps ....................... Generate images in EPS format
     --latex ..................... Generate LaTeX/TikZ output
     --obfuscate ................. Replace text in diagrams with obfuscated strings to share diagrams safely
     --png ....................... Generate PNG images (default)
     --preproc ................... Generate the preprocessed source after applying !include, !define... (no rendering)
     --svg ....................... Generate SVG images
     --txt ....................... Generate ASCII art diagrams
     --utxt ...................... Generate ASCII art diagrams using Unicode characters


Examples:
  # Process all .puml recursively
  java -jar plantuml.jar "**/*.puml"

  # Check syntax only (CI)
  java -jar plantuml.jar --check-syntax src/diagrams

  # Read from stdin and write to stdout (SVG)
  cat diagram.puml | java -jar plantuml.jar --svg -pipe > out.svg

  # Encode a sprite from an image
  java -jar plantuml.jar --sprite 16z myicon.png

  # Use a define
  java -jar plantuml.jar -DAUTHOR=John diagram.puml

  # Change output directory
  java -jar plantuml.jar --format svg --output-dir out diagrams/

Exit codes:
  0    Success
  50   No file found
  100  No diagram found in file(s)
  200  Some diagrams have syntax errors

See also:
  java -jar plantuml.jar --help-more
  Documentation: https://plantuml.com
#+end_example
